Autodesk.Revit.DB.Structure.IStructuralConnectionsProviderProxy.GetTypeCodeCheckingStatus(Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData)
The method that will be called to check if given connection type has code checking support
Remarks:
The Connections Provider provides information about code checking support status for given connection type.
data:
The Structural Connections Type Info data.
Returns:
Indicates whether the Structural Connections Provider is executed successfully.
Since:
2017

Autodesk.Revit.DB.Structure.IStructuralConnectionsProviderProxy.GetTypeInfo(Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData)
The method that will be called to get detailed information for given connection type.
Remarks:
The Connections Provider provides detailed information about given connection type.
data:
The Structural Connections Type Info data.
Returns:
Indicates whether the Structural Connections Provider is executed successfully.
Since:
2017

Autodesk.Revit.DB.Structure.IStructuralConnectionsProviderProxy.GetAvailableConnectionTypes(Autodesk.Revit.DB.Structure.StructuralConnectionsProviderData)
The method that will be called to get list of available connection types for given connection.
Remarks:
The method allows to obtain a list of available connection types from the Connections Provider.
If the passed data contains id of valid Connection Handler the method provides a list of GUIDs of available connections
types which are applicable for this element. Otherwise it provides list of GUIDs of all available connection types.
Provided list of available types is returned via data parameter.
data:
The Structural Connections Provider data.
Returns:
Indicates whether the Structural Connections Provider is executed successfully.
Since:
2017